hello
사진 찍는거
add(사진찍게 다들 모여봐) -> commit(사진을 찍는거) -> push(구글 드라이브에 업로드)

fetch -> 가져오기
rebase -> 병합하기
stash -> 임시 저장하는 거에요
스택을 만들어서 제가 지금까지 작성한 코드들을 스택에 넣어놔요
fetch로 main에 있는걸 가져오고 rebase로 병합하고 스택에서 꺼내는거에요

feat/login -> 브랜치
feat/board
feat/signup
아이디, 비밀번호 입력창 구현
로그인 버튼 구현
자동로그인 구현
push pr(보통 200-400줄 정도의 분량)

로그인 실패 시 메시지 띄우기 구현
아만앙ㄴ란아
이ㅏㄴ리ㅓㄹㅇ
ㄴ이ㅏ러니
push pr

fix/login

프론트 -> ui랑 로컬에서 구현가능한 기능들 -> api 연결
백엔드 -> api를 만들어야 합니다 정부에서 지정한 공식 프레임워크 spring -> 모든 대기업이 다 이걸써서
java를 이용하고 제가 알기론 다른 프레임워크에 비해 어려워서

자바하면서 해도 되고, sql쪽을 해보셔야 되고 아키텍처 mvc 패턴, jpa
인프런 김영한 스프링

데이터베이스

캘린더 뷰를 만들었어